using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using 工具;

namespace 字符串操作
{
    public class 头文件
    {
        public static string HeadTXT()
        {
            string str = "";
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	向 计算机之父 John von Neumann（约翰·冯·诺依曼）       致敬	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	向 J A V A 之父 James Gosling（詹姆斯·高斯林）          致敬	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	向 C# 之父 Anders Hejlsberg（安德斯·海尔斯伯格）        致敬	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	向 C 语言之父 Dennis MacAlistair Ritchie（丹尼斯·里奇） 致敬	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	感 谢 开 源 , 感 谢 为 开 源 做 出 贡 献 的 人 们。 *	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	感 谢 这 个 美 好 的 世 界 , 感 谢 为 这 个 美 好 的 世 界 默 默 付 出 的 人 们。	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	感 谢 g i t h u b . c o m	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	感 谢 某 杰 新 材 料 股 份 有 限 公 司	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	感 谢 浙 江 某 杰 铝 业 有 限 公 司	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	项 目 归 属 ： 浙 江 佳 轩 物 流 有 限 公 司	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	此文件由【佳轩实体类自动生成工具】生成	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	文件生成时间：	*	" + DateTime.Now.ToString("yyyy年MM月dd日HH点mm分") + @"	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	工具创造时间：	*	2018年08月01日13点45分	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	【佳轩 WMS实体类自动生成工具】由【佳轩 WMS项目组】提供	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*   *   *   *   *   *   *   *   *   *   * 项目创建者 某杰HOME 项目组 诸迪耀 *   *   *   *   *	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*   第一代维护者（2018年08月01日 至 2018年09月08日） 某杰HOME 项目组 罗来飞 *   *   *   *   *	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*   第二代维护者（2018年09月08日 至 2019年04月22日） 某杰HOME 项目组 诸迪耀 *   *   *   *   *	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	第三代维护者（2019年04月23日 至 2019年12月01日） 佳轩 WMS 项目组 陈建成 *	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	第三代维护者（2019年04月23日 至 2019年12月01日） 佳轩 WMS 项目组 诸迪耀 *	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	第四代维护者（2019年12月01日 至 --------------） 佳轩系统开发部  朱志明 *	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	第四代维护者（2019年12月01日 至 --------------） 佳轩系统开发部  诸迪耀 *	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	每 一 个 活 着 的 生 命 都 值 得 尊 敬	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);
            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(1);


            str = str + @"//                          _ooOoo_" + 符号类.换行符号(1);
            str = str + @"//                         o8888888o" + 符号类.换行符号(1);
            str = str + @"//                         88"". ""88""" + 符号类.换行符号(1);
            str = str + @"//                         (| -_- |)" + 符号类.换行符号(1);
            str = str + @"//                         O\  =  /O" + 符号类.换行符号(1);
            str = str + @"//                     ____ /`---'\____" + 符号类.换行符号(1);
            str = str + @"//                    .'  \\|     |//  `." + 符号类.换行符号(1);
            str = str + @"//                   /  \\|||  :  |||//  \" + 符号类.换行符号(1);
            str = str + @"//                  /  _||||| -:- |||||-  \" + 符号类.换行符号(1);
            str = str + @"//                  |   | \\\  -  /// |   |" + 符号类.换行符号(1);
            str = str + @"//                  | \_ |  ''\---/''  |   | " + 符号类.换行符号(1);
            str = str + @"//                  \  .-\__  `-`  ___/-. / " + 符号类.换行符号(1);
            str = str + @"//                ___`. .'  /--.--\  `. . __" + 符号类.换行符号(1);
            str = str + @"//             ."" '<  `.___\_<|>_/___.'  > '""." + 符号类.换行符号(1);
            str = str + @"//            | | :  `- \`.;`\ _ /`;.`/ - ` : | | " + 符号类.换行符号(1);
            str = str + @"//            \  \ `-.   \_ __\ /__ _/   .-` /  / " + 符号类.换行符号(1);
            str = str + @"//       ======`-.____`-.___\_____/___.-`____.- '======" + 符号类.换行符号(1);
            str = str + @"//                         `= ---= '" + 符号类.换行符号(1);
            str = str + @"//       ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ " + 符号类.换行符号(1);
            str = str + @"//                  佛祖保佑       永无BUG" + 符号类.换行符号(1);


            str = str + 符号类.制表符号(0) + "//	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*	*" + 符号类.换行符号(2);

            return str;
        }
    }
}
